FKDD_COPY_DIFF_3_2026-02-14/Documents/ОтражениеФактическихЗначенийKPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОтражениеФактическихЗначенийKPI</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ФактическиеЗначенияKPI</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторПоследнегоИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОперацииВводаФакта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОбъект</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииДолжностейСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПерсональныеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.KPI</v8:Type>
								<v8:Type>cfg:CatalogRef.ПоказателиДляРасчетаМотивации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбщиеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.KPI</v8:Type>
								<v8:Type>cfg:CatalogRef.ПоказателиДляРасчетаМотивации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>Периодичность</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
					<Comment>Неделя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
					<Comment>Декада</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
					<Comment>Месяц</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
					<Comment>Квартал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
					<Comment>Год</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произвольный</Name>
					<Comment>Произвольный</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ВидОперацииВводаФакта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидОперацииВводаФакта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводЦелевыхПоказателей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводСмартЗадач</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ВидРасчетаKPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидРасчетаKPI</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автоматический</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РучнойВвод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/ОтражениеФактическихЗначенийKPI/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ПравоKPI=обПраво("ДоступКKPI");
	//Если ПравоKPI=Перечисления.ПризнакОтветственности.Запрет Тогда
	//	ЭтаФорма.ТолькоПросмотр=Истина;
	//КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Периодичность = Перечисления.Периодичность.Месяц;
		Объект.ПериодПланирования = НачалоМесяца(ТекущаяДата());
		Объект.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
		Объект.Организация = Справочники.Организации.ОсновнаяОрганизация;
		Объект.Автор = ПараметрыСеанса.Пользователь;
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидОперацииВводаФакта.ВводСмартЗадач");
		
        Элементы.ФормаГруппаВидОперации.ПодчиненныеЭлементы.ФормаКомандаВводСмартЗадач.Пометка = Истина;
		
	КонецЕсли;	

	ДействияФормыОперация();
	
	СписокЗначения=Новый Массив;
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Год"));
	
	Элементы.Периодичность.СписокВыбора.ЗагрузитьЗначения(СписокЗначения);
	
	Модифицированность = Ложь;
	
	ПроверитьОтображениеКолонкиКатегория(); 
	
	Мотивация.ПроверитьДоступностьОбъектаПоДатеЗапрета(Объект, ЭтаФорма,Объект.ПериодПланирования,Объект.Организация,Объект.ПодразделениеКомпании);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВводСмартЗадач(Команда)
	
	Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидОперацииВводаФакта.ВводСмартЗадач");
	Элементы.ФормаГруппаВидОперации.ПодчиненныеЭлементы.ФормаКомандаВводСмартЗадач.Пометка = Истина;
	Элементы.ФормаГруппаВидОперации.ПодчиненныеЭлементы.ФормаКнопкаВводЦелевыхПоказателей.Пометка = Ложь;
	
	//Элементы.ФормаГруппаВидОперации
	ДействияФормыОперация();

КонецПроцедуры

&НаКлиенте
Процедура КомандаВводЦелевыхПоказателей(Команда)
	
	Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидОперацииВводаФакта.ВводЦелевыхПоказателей");
	Элементы.ФормаГруппаВидОперации.ПодчиненныеЭлементы.ФормаКомандаВводСмартЗадач.Пометка = Ложь;
	Элементы.ФормаГруппаВидОперации.ПодчиненныеЭлементы.ФормаКнопкаВводЦелевыхПоказателей.Пометка = Истина;
	
	ДействияФормыОперация();

КонецПроцедуры

Процедура ДействияФормыОперация()
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидОперацииВводаФакта.ВводСмартЗадач") Тогда
		
		Элементы.ФормаГруппаВидОперации.ПодчиненныеЭлементы.ФормаКомандаВводСмартЗадач.Пометка = Истина;
		Элементы.ФормаГруппаВидОперации.ПодчиненныеЭлементы.ФормаКнопкаВводЦелевыхПоказателей.Пометка = Ложь;
		Элементы.Периодичность.Видимость = Истина;
		Элементы.ПерсональныеПоказатели.ПодчиненныеЭлементы.ПерсональныеПоказателиПоказатель.Заголовок = "Смарт задача";
		
	ИначеЕсли  Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидОперацииВводаФакта.ВводЦелевыхПоказателей") Тогда
		
		Элементы.ФормаГруппаВидОперации.ПодчиненныеЭлементы.ФормаКомандаВводСмартЗадач.Пометка = Ложь;
		Элементы.ФормаГруппаВидОперации.ПодчиненныеЭлементы.ФормаКнопкаВводЦелевыхПоказателей.Пометка = Истина;
		Элементы.Периодичность.Видимость = Ложь;
		Элементы.ПерсональныеПоказатели.ПодчиненныеЭлементы.ПерсональныеПоказателиПоказатель.Заголовок = "Показатель";
		
	КонецЕсли;      
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПериодичностьПриИзменении(Элементы.Периодичность);

КонецПроцедуры

&НаСервере
Процедура ПроверитьОтображениеКолонкиКатегория()
	
	мЕстьДанныеДляКолонки = Ложь;
	
	Для каждого СтрДолжности из Объект.Сотрудники Цикл
		Если СтрДолжности.Сотрудник.Должность.КатегорийнаяДолжность Тогда
			мЕстьДанныеДляКолонки = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.Сотрудники.ПодчиненныеЭлементы.СотрудникиКатегория.Видимость = мЕстьДанныеДляКолонки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
		
	Если Объект.Периодичность=Перечисления.Периодичность.Месяц Тогда
		
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодПланирования);
		
	ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Год Тогда
		
		Объект.ПериодПланирования=НачалоМесяца(КонецГода(Объект.ПериодПланирования));
		ДатаПланирования=Формат(Год(Объект.ПериодПланирования),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		
	ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Квартал Тогда
		
		Объект.ПериодПланирования=НачалоМесяца(КонецКвартала(Объект.ПериодПланирования));
		ДатаПланирования=Формат(Объект.ПериодПланирования,"ДФ='q КВ.  yyyy'; ДЛФ=");
		
	ИначеЕсли ПустаяСтрока(Объект.Периодичность) Тогда
		
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодПланирования);
		
	Иначе
		
		Сообщить("Неверная периодичность!");
		Объект.Периодичность="";
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодПланирования);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	СписокЗначения=Новый СписокЗначений;
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
	СписокЗначения.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Год"));
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПериодичностьНачалоВыбораЗавершение", ЭтотОбъект), СписокЗначения, Элементы.Периодичность);

КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда 
		
		Объект.Периодичность= ВыбранныйЭлемент.Значение;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодПланированияПриИзменении(Элемент)
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
	    Мотивация.ДатаКакМесяцПодобратьДатуПоТексту(ДатаПланирования, Объект.ПериодПланирования);
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодПланирования);

	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодПланированияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
		НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ДатаПланирования, СтандартнаяОбработка, Объект.ПериодПланирования);
		
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		
		Если Объект.ПериодПланирования<Дата("01.01.2000 00:00:00") Тогда
			НачГод=Формат(Год(ТекущаяДата())-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			КонГод=Формат(Год(ТекущаяДата())+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			ТекГод=Формат(Год(ТекущаяДата()),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		Иначе
			НачГод=Формат(Год(Объект.ПериодПланирования)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			КонГод=Формат(Год(Объект.ПериодПланирования)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			ТекГод=Формат(Год(Объект.ПериодПланирования),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		КонецЕсли;
		
		НеВыбран=истина;
		Пока НеВыбран Цикл
			
			СпКварталов=Новый СписокЗначений;
			СпКварталов.Добавить("... "+НачГод);
			
			Для Сч=1 по 4 Цикл
				СпКварталов.Добавить(Формат(Сч,"ЧЦ=1; ЧРД=; ЧРГ=; ЧГ=")+" КВ."+ТекГод);
			КонецЦикла;
			
			СпКварталов.Добавить("... "+КонГод);
			Эл=ВыбратьИзМеню(СпКварталов,Элемент);
			Если Не ПустаяСтрока(Эл) Тогда
				Если Найти(Эл.Значение,НачГод) Тогда
					НачГод=Формат(Число(НачГод)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					ТекГод=Формат(Число(НачГод),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					КонГод=Формат(Число(НачГод)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					Продолжить;
				КонецЕсли;
				
				Если Найти(Эл.Значение,КонГод) Тогда
					НачГод=Формат(Число(КонГод)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					ТекГод=Формат(Число(КонГод),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					КонГод=Формат(Число(КонГод)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					Продолжить;
				КонецЕсли;
				
				НеВыбран=ложь;
				ДатаПланирования=Эл.Значение;
				Объект.ПериодПланирования=Дата(Число(ТекГод),Число(Лев(Эл.Значение,1))*3-2,1);
				Объект.ПериодПланирования=НачалоМесяца(КонецКвартала(Объект.ПериодПланирования));
			Иначе
				НеВыбран=ложь;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		
		Если Объект.ПериодПланирования<Дата("01.01.2000 00:00:00") Тогда
			НачГод=Год(ТекущаяДата())-3;
			КонГод=Год(ТекущаяДата())+3;
		Иначе
			НачГод=Год(Объект.ПериодПланирования)-3;
			КонГод=Год(Объект.ПериодПланирования)+3;
		КонецЕсли;
		
		СпГодов=Новый СписокЗначений;
		Для Сч=НачГод по КонГод Цикл
			СпГодов.Добавить(Формат(Сч,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ="));
		КонецЦикла;
		
		Эл=ВыбратьИзМеню(СпГодов,Элемент);
		
		Если Не ПустаяСтрока(Эл) Тогда
			ДатаПланирования=Эл.Значение;
			Объект.ПериодПланирования=Дата("01.01."+ДатаПланирования+" 00:00:00");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПланированияНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
		НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ДатаПланирования, СтандартнаяОбработка, Объект.ПериодПланирования);
		
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		
		Если Объект.ПериодПланирования<Дата("01.01.2000 00:00:00") Тогда
			НачГод=Формат(Год(ТекущаяДата())-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			КонГод=Формат(Год(ТекущаяДата())+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			ТекГод=Формат(Год(ТекущаяДата()),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		Иначе
			НачГод=Формат(Год(Объект.ПериодПланирования)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			КонГод=Формат(Год(Объект.ПериодПланирования)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
			ТекГод=Формат(Год(Объект.ПериодПланирования),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
		КонецЕсли;
		
		НеВыбран=истина;
		Пока НеВыбран Цикл
			
			СпКварталов=Новый СписокЗначений;
			СпКварталов.Добавить("... "+НачГод);
			
			Для Сч=1 по 4 Цикл
				СпКварталов.Добавить(Формат(Сч,"ЧЦ=1; ЧРД=; ЧРГ=; ЧГ=")+" КВ."+ТекГод);
			КонецЦикла;
			
			СпКварталов.Добавить("... "+КонГод);
			Эл=ВыбратьИзМеню(СпКварталов,Элемент);
			Если Не ПустаяСтрока(Эл) Тогда
				Если Найти(Эл.Значение,НачГод) Тогда
					НачГод=Формат(Число(НачГод)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					ТекГод=Формат(Число(НачГод),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					КонГод=Формат(Число(НачГод)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					Продолжить;
				КонецЕсли;
				
				Если Найти(Эл.Значение,КонГод) Тогда
					НачГод=Формат(Число(КонГод)-1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					ТекГод=Формат(Число(КонГод),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					КонГод=Формат(Число(КонГод)+1,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
					Продолжить;
				КонецЕсли;
				
				НеВыбран=ложь;
				ДатаПланирования=Эл.Значение;
				Объект.ПериодПланирования=Дата(Число(ТекГод),Число(Лев(Эл.Значение,1))*3-2,1);
				Объект.ПериодПланирования=НачалоМесяца(КонецКвартала(Объект.ПериодПланирования));
			Иначе
				НеВыбран=ложь;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		
		Если Объект.ПериодПланирования<Дата("01.01.2000 00:00:00") Тогда
			НачГод=Год(ТекущаяДата())-3;
			КонГод=Год(ТекущаяДата())+3;
		Иначе
			НачГод=Год(Объект.ПериодПланирования)-3;
			КонГод=Год(Объект.ПериодПланирования)+3;
		КонецЕсли;
		
		СпГодов=Новый СписокЗначений;
		Для Сч=НачГод по КонГод Цикл
			СпГодов.Добавить(Формат(Сч,"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ="));
		КонецЦикла;
		
		Эл=ВыбратьИзМеню(СпГодов,Элемент);
		
		Если Не ПустаяСтрока(Эл) Тогда
			ДатаПланирования=Эл.Значение;
			Объект.ПериодПланирования=Дата("01.01."+ДатаПланирования+" 00:00:00");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодПланированияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		
		Объект.ПериодПланирования = ДобавитьМесяц(Объект.ПериодПланирования, Направление);
		ДатаПланирования = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодПланирования);

	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		
		Если Направление>0 Тогда
			Объект.ПериодПланирования=ДобавитьМесяц(Объект.ПериодПланирования,3);
		Иначе
			Объект.ПериодПланирования=ДобавитьМесяц(Объект.ПериодПланирования,-3);
		КонецЕсли;
		
		ДатаПланирования = Формат(Объект.ПериодПланирования,"ДФ='q КВ.  yyyy'; ДЛФ=");
		
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		
		Если Направление>0 Тогда
			Объект.ПериодПланирования=ДобавитьМесяц(Объект.ПериодПланирования,12);
		Иначе
			Объект.ПериодПланирования=ДобавитьМесяц(Объект.ПериодПланирования,-12);
		КонецЕсли;
		
		ДатаПланирования=Формат(Год(Объект.ПериодПланирования),"ЧЦ=4; ЧРД=; ЧРГ=; ЧГ=");
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ПериодПланирования, СтандартнаяОбработка, ПериодРегистрации, НачальноеЗначение = Неопределено, МинГод=Неопределено) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Если НачальноеЗначение = Неопределено Тогда
		НачальноеЗначение = ПериодРегистрации;
	КонецЕсли; 
	
	СписокВыбора = Новый СписокЗначений;
	НачалоТекущегоГода = НачалоГода(НачальноеЗначение);
	НачалоПрошлогоГода = НачалоГода(НачалоТекущегоГода - 1);
	
	Если НЕ МинГод=Неопределено Тогда
		Если НачалоПрошлогоГода<МинГод Тогда
			НачалоПрошлогоГода =МинГод;
		КонецЕсли;
	КонецЕсли;
	
	СписокВыбора.Добавить(НачалоПрошлогоГода, (Формат(НачалоПрошлогоГода, "ДФ='yyyy'") + "..."));
	НачалоМесяцаЗаполнения = НачалоТекущегоГода;
	ЭлементПоУмолчанию = Неопределено;
	Для а = 1 По 12 Цикл
		Если НЕ МинГод=Неопределено Тогда
			
			Если НачалоМесяцазаполнения<МинГод Тогда
				НачалоМесяцаЗаполнения = ДобавитьМесяц(НачалоМесяцаЗаполнения, 1);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		ДобавленныйЭлемент = СписокВыбора.Добавить(НачалоМесяцаЗаполнения, Мотивация.ДатаКакМесяцПредставление(НачалоМесяцаЗаполнения));
		Если НачальноеЗначение = НачалоМесяцаЗаполнения Тогда
			ЭлементПоУмолчанию = ДобавленныйЭлемент;
		КонецЕсли; 
		
		НачалоМесяцаЗаполнения = ДобавитьМесяц(НачалоМесяцаЗаполнения, 1);
	КонецЦикла;
	НачалоСледующегоГода = КонецГода(НачалоТекущегоГода) + 1;
	СписокВыбора.Добавить(НачалоСледующегоГода, (Формат(НачалоСледующегоГода, "ДФ='yyyy'") + "..."));
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ПериодПланирования",ПериодПланирования);
	ДопПараметры.Вставить("МинГод",МинГод);
	ДопПараметры.Вставить("НачальноеЗначение",НачальноеЗначение);
	ДопПараметры.Вставить("СтандартнаяОбработка",СтандартнаяОбработка);
	ДопПараметры.Вставить("ПериодРегистрации",ПериодРегистрации);
	
    ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПериодаРегистрацииНачалоВыбораЗавершение", ЭтотОбъект, ДопПараметры), СписокВыбора, ПериодПланирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодаРегистрацииНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	ИначеЕсли Год(ВыбранныйЭлемент.Значение) <> Год(ДополнительныеПараметры.НачальноеЗначение) Тогда
		НачалоВыбораИзСпискаПредставленияПериодаРегистрации(ДополнительныеПараметры.ПериодПланирования, ДополнительныеПараметры.СтандартнаяОбработка, ДополнительныеПараметры.ПериодРегистрации, ВыбранныйЭлемент.Значение, ДополнительныеПараметры.МинГод);
		Возврат;
	КонецЕсли;
	
	Объект.ПериодПланирования = ВыбранныйЭлемент.Значение;
	ДатаПланирования  = Мотивация.ДатаКакМесяцПредставление(Объект.ПериодПланирования);

КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Сотрудники.ТекущиеДанные<>Неопределено Тогда
		
		ТекущаяСтрока = Элементы.Сотрудники.ТекущиеДанные;
		
		КлючОтбора = Новый ФиксированнаяСтруктура("Сотрудник",  ТекущаяСтрока.Сотрудник);
		
		Элементы.ПерсональныеПоказатели.ОтборСтрок = КлючОтбора;
		
		ТекущийСотрудник = Элементы.Сотрудники.ТекущиеДанные.Сотрудник;
		
		НайденыеСтроки = Объект.ПерсональныеПоказатели.НайтиСтроки(Новый Структура("Сотрудник",ТекущийСотрудник));
		
		Если НЕ НайденыеСтроки.Количество() = 0 Тогда
			Для Каждого Строка ИЗ НайденыеСтроки Цикл
				
				
				Строка.Код = Строка.Показатель.Код;
				
			КонецЦикла;
		Конецесли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПередУдалением(Элемент, Отказ)
	
	Если Элементы.Сотрудники.ТекущиеДанные<>Неопределено Тогда
		ТекущийСотрудник = Элементы.Сотрудники.ТекущиеДанные.Сотрудник;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПослеУдаления(Элемент)
	
	МС = Объект.ПерсональныеПоказатели.НайтиСтроки(Новый Структура("Сотрудник", ТекущийСотрудник));
	Для Каждого Эл из МС Цикл
		Объект.ПерсональныеПоказатели.Удалить(Эл);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	СотрудникиПриАктивизацииСтроки(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	
	Если Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		НачПериода=НачалоМесяца(Объект.ПериодПланирования);
		КонПериода=КонецМесяца(Объект.ПериодПланирования);
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		НачПериода=НачалоКвартала(Объект.ПериодПланирования);
		КонПериода=КонецКвартала(Объект.ПериодПланирования);
	ИначеЕсли Объект.Периодичность=ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		НачПериода=НачалоГода(Объект.ПериодПланирования);
		КонПериода=КонецГода(Объект.ПериодПланирования);
	Иначе
		Сообщить("Неверная периодичность");
		Возврат;
	КонецЕсли;
	
	Если Элементы.Сотрудники.ТекущиеДанные<>Неопределено Тогда
		
		ТекущаяСтрока = Элементы.Сотрудники.ТекущиеДанные;
		
		
		МС=Объект.ПерсональныеПоказатели.НайтиСтроки(Новый Структура("Сотрудник", ТекущийСотрудник));
		Для Каждого Эл из МС Цикл
			Эл.Сотрудник = ТекущаяСтрока.Сотрудник;
		КонецЦикла;
		
	КонецЕсли;

	ЗаполнитьПоСотруднику(КонПериода);
	СотрудникиПриАктивизацииСтроки(Элемент);
	
	ПроверитьОтображениеКолонкиКатегория(); 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоСотруднику(КонПериода)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидОперацииВводаФакта.ВводЦелевыхПоказателей") Тогда
		
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	СоставKPI.Должность,
		|	СоставKPI.Категория,
		|	СоставKPI.KPI,
		|	СоставKPI.Вес,
		|	СоставKPI.Период
		|ИЗ
		|	РегистрСведений.СоставKPI.СрезПоследних(&Дата, ) КАК СоставKPI
		|ГДЕ
		|	СоставKPI.Должность = &Должность
		|	И СоставKPI.Категория = &Категория
		|	И СоставKPI.Периодичность = &Периодичность
		|	И СоставKPI.KPI.СпособРасчета = &СпособРасчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	СоставKPI.Период УБЫВ");
		
		Запрос.УстановитьПараметр("Должность", ТекущийСотрудник);
		Запрос.УстановитьПараметр("Категория", ТекущийСотрудник.КатегорияДолжности);
		Запрос.УстановитьПараметр("Дата", КонПериода);
		Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
		Запрос.УстановитьПараметр("СпособРасчета", Перечисления.ВидРасчетаKPI.Автоматический);
		
		ТЗ=Запрос.Выполнить().Выгрузить();
		
		Если ТЗ.Количество()=0 Тогда
			
			Запрос.УстановитьПараметр("Должность", ТекущийСотрудник.Должность);
			Запрос.УстановитьПараметр("Категория", ТекущийСотрудник.КатегорияДолжности);
			Запрос.УстановитьПараметр("Дата", КонПериода);
			Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
			Запрос.УстановитьПараметр("СпособРасчета", Перечисления.ВидРасчетаKPI.Автоматический);
			
		КонецЕсли;
		
		Выб=Запрос.Выполнить().Выбрать();
		ПослДата=Дата("01.01.01 00:00:00");
		
		Если Выб.Следующий() Тогда
			ПослДата=Выб.Период;
		КонецЕсли;
		
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	СоставKPI.Должность,
		|	СоставKPI.Категория,
		|	СоставKPI.KPI,
		|	СоставKPI.Вес
		|ИЗ
		|	РегистрСведений.СоставKPI.СрезПоследних(&Дата, ) КАК СоставKPI
		|ГДЕ
		|	СоставKPI.Должность = &Должность
		|	И СоставKPI.Категория = &Категория
		|	И СоставKPI.Периодичность = &Периодичность
		|	И СоставKPI.KPI.СпособРасчета = &СпособРасчета
		|	И СоставKPI.Период = &Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	СоставKPI.Период УБЫВ");
		
		Запрос.УстановитьПараметр("Должность", ТекущийСотрудник);
		Запрос.УстановитьПараметр("Категория", ТекущийСотрудник.КатегорияДолжности);
		Запрос.УстановитьПараметр("Дата", КонПериода);
		Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
		Запрос.УстановитьПараметр("СпособРасчета", Перечисления.ВидРасчетаKPI.Автоматический);
		Запрос.УстановитьПараметр("Период", ПослДата);
		
		ТЗ=Запрос.Выполнить().Выгрузить();
		
		Если ТЗ.Количество()=0 Тогда
			
			Запрос.УстановитьПараметр("Должность", ТекущийСотрудник.Должность);
			Запрос.УстановитьПараметр("Категория", ТекущийСотрудник.КатегорияДолжности);
			Запрос.УстановитьПараметр("Дата", КонПериода);
			Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
			Запрос.УстановитьПараметр("СпособРасчета", Перечисления.ВидРасчетаKPI.Автоматический);
			Запрос.УстановитьПараметр("Период", ПослДата);
			
		КонецЕсли;
		
		Выб=Запрос.Выполнить().Выбрать();
		Пока Выб.Следующий() Цикл
			
			СпПар=ПолучитьСписокПараметров(Выб.KPI.Формула);
			
			Для Каждого ТекЭл из СпПар Цикл
				
				Если ТекЭл.Значение.ВидПоказателя=Перечисления.ВидРасчетаKPI.РучнойВвод Тогда
					
					Если ТекЭл.Значение.Общий Тогда
						
						Если Объект.ОбщиеПоказатели.Найти(ТекЭл.Значение,"KPI")=Неопределено Тогда
							Нов=Объект.ОбщиеПоказатели.Добавить();
							Нов.KPI=ТекЭл.Значение;
						КонецЕсли;
						
					Иначе
						
						Нов=Объект.ПерсональныеПоказатели.Добавить();
						Нов.KPI=ТекЭл.Значение;
						Нов.Сотрудник=ТекущийСотрудник;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидОперацииВводаФакта.ВводСмартЗадач") Тогда 
		
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	СоставKPI.Должность,
		|	СоставKPI.Категория,
		|	СоставKPI.KPI,
		|	СоставKPI.Вес,
		|	СоставKPI.Период
		|ИЗ
		|	РегистрСведений.СоставKPI.СрезПоследних(&Дата, ) КАК СоставKPI
		|ГДЕ
		|	СоставKPI.Должность = &Должность
		|	И СоставKPI.Категория = &Категория
		|	И СоставKPI.Периодичность = &Периодичность
		|	И СоставKPI.KPI.СпособРасчета = &СпособРасчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	СоставKPI.Период УБЫВ");
		
		Запрос.УстановитьПараметр("Должность", ТекущийСотрудник);
		Запрос.УстановитьПараметр("Категория", ТекущийСотрудник.КатегорияДолжности);
		Запрос.УстановитьПараметр("Дата", КонПериода);
		Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
		Запрос.УстановитьПараметр("СпособРасчета", Перечисления.ВидРасчетаKPI.РучнойВвод);
		
		ТЗ=Запрос.Выполнить().Выгрузить();
		
		Если ТЗ.Количество()=0 Тогда
			
			Запрос.УстановитьПараметр("Должность", ТекущийСотрудник.Должность);
			Запрос.УстановитьПараметр("Категория", ТекущийСотрудник.КатегорияДолжности);
			Запрос.УстановитьПараметр("Дата", КонПериода);
			Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
			Запрос.УстановитьПараметр("СпособРасчета", Перечисления.ВидРасчетаKPI.РучнойВвод);
			
		КонецЕсли;
		
		Выб=Запрос.Выполнить().Выбрать();
		ПослДата=Дата("01.01.01 00:00:00");
		
		Если Выб.Следующий() Тогда
			ПослДата=Выб.Период;
		КонецЕсли;
		
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	СоставKPI.Должность,
		|	СоставKPI.Категория,
		|	СоставKPI.KPI,
		|	СоставKPI.Вес
		|ИЗ
		|	РегистрСведений.СоставKPI.СрезПоследних(&Дата, ) КАК СоставKPI
		|ГДЕ
		|	СоставKPI.Должность = &Должность
		|	И СоставKPI.Категория = &Категория
		|	И СоставKPI.Периодичность = &Периодичность
		|	И СоставKPI.KPI.СпособРасчета = &СпособРасчета
		|	И СоставKPI.Период = &Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	СоставKPI.Период УБЫВ");
		
		Запрос.УстановитьПараметр("Должность", ТекущийСотрудник);
		Запрос.УстановитьПараметр("Категория", ТекущийСотрудник.КатегорияДолжности);
		Запрос.УстановитьПараметр("Дата", КонПериода);
		Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
		Запрос.УстановитьПараметр("СпособРасчета", Перечисления.ВидРасчетаKPI.РучнойВвод);
		Запрос.УстановитьПараметр("Период", ПослДата);
		
		ТЗ=Запрос.Выполнить().Выгрузить();
		
		Если ТЗ.Количество()=0 Тогда
			
			Запрос.УстановитьПараметр("Должность", ТекущийСотрудник.Должность);
			Запрос.УстановитьПараметр("Категория", ТекущийСотрудник.КатегорияДолжности);
			Запрос.УстановитьПараметр("Дата", КонПериода);
			Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
			Запрос.УстановитьПараметр("СпособРасчета", Перечисления.ВидРасчетаKPI.РучнойВвод);
			Запрос.УстановитьПараметр("Период", ПослДата);
			
		КонецЕсли;
		
		Выб=Запрос.Выполнить().Выбрать();
		Пока Выб.Следующий() Цикл
			
			Если Выб.KPI.СпособРасчета=Перечисления.ВидРасчетаKPI.РучнойВвод Тогда
				
				Нов=Объект.ПерсональныеПоказатели.Добавить();
				Нов.Показатель=Выб.KPI;
				Нов.Сотрудник=ТекущийСотрудник;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПараметров(Знач ТекФормула)
	
	СпПар=Новый СписокЗначений;
	
	Найден=истина;
	
	Пока Найден Цикл
		
		Поз1=Найти(ТекФормула,"[");
		Поз2=Найти(ТекФормула,"]");
		
		Если Поз1>0 Тогда
			
			Найден=истина;
			ТекКод=Сред(ТекФормула,Поз1+1,Поз2-Поз1-1);
			ТекФормула=Сред(ТекФормула,Поз2+1);
			Эл=Справочники.ПоказателиДляРасчетаМотивации.НайтиПоКоду(ТекКод,,,);
			
			Если СпПар.НайтиПоЗначению(Эл)=Неопределено Тогда
				НовЗн=СпПар.Добавить();
				НовЗн.Значение=Эл;
				НовЗН.Представление="["+ТекКод+"]";
			КонецЕсли;
			
		Иначе
			Найден=ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат  СпПар;
	
КонецФункции

&НаКлиенте
Процедура ПерсональныеПоказателиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.Сотрудники.ТекущиеДанные=Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерсональныеПоказателиПоказательПриИзменении(Элемент)
			
	ТекущаяСтрока = Элементы.ПерсональныеПоказатели.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено 
		И ЗначениеЗаполнено(ТекущаяСтрока.Показатель) Тогда
		
		ТекущаяСтрока.Код = ТекущаяСтрока.Показатель.Код;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбщиеПоказателиПоказательПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ОбщиеПоказатели.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено 
		И ЗначениеЗаполнено(ТекущаяСтрока.Показатель) Тогда
		
		ТекущаяСтрока.Код = ТекущаяСтрока.Показатель.Код;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПерсональныеПоказателиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока Тогда
		Элементы.ПерсональныеПоказатели.ТекущиеДанные.Сотрудник=Элементы.Сотрудники.ТекущиеДанные.Сотрудник;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаСотрудникиЗаполнить(Команда)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидОперацииВводаФакта.ВводСмартЗадач") 
		Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидОперацииВводаФакта.ВводЦелевыхПоказателей") Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("КомандаСотрудникиЗаполнитьЗавершение", ЭтотОбъект), "Таблица будет перезаполнена! Продолжить?",РежимДиалогаВопрос.ДаНетОтмена);
		
		Возврат;
		
	КонецЕсли;
	
	КомандаСотрудникиЗаполнитьФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСотрудникиЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьПоKPI();
		
	КонецЕсли;
	
	КомандаСотрудникиЗаполнитьФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура КомандаСотрудникиЗаполнитьФрагмент()
	
	Объект.Сотрудники.Сортировать("Сотрудник");
	
	ПроверитьОтображениеКолонкиКатегория();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоKPI()
	
	Если Объект.Периодичность=Перечисления.Периодичность.Месяц Тогда
		НачПериода=НачалоМесяца(Объект.ПериодПланирования);
		КонПериода=КонецМесяца(Объект.ПериодПланирования);
	ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Квартал Тогда
		НачПериода=НачалоКвартала(Объект.ПериодПланирования);
		КонПериода=КонецКвартала(Объект.ПериодПланирования);
	ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Год Тогда
		НачПериода=НачалоГода(Объект.ПериодПланирования);
		КонПериода=КонецГода(Объект.ПериодПланирования);
	Иначе
		Сообщить("Неверная периодичность");
		Возврат;
	КонецЕсли;
	
	Объект.Сотрудники.Очистить();
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	Сотрудники.Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	НЕ Сотрудники.ПометкаУдаления
	|	И НЕ Сотрудники.ЭтоГруппа
	|	И (Сотрудники.Подразделение = &Подразделение
	|			ИЛИ &ВсеПодразделения)
	|	И (НЕ Сотрудники.ДатаУвольнения < &Период
	|			ИЛИ Сотрудники.ДатаУвольнения = &Пусто)
	|	И Сотрудники.ДатаПриема < &ДатаПриема
	|	И Сотрудники.ДатаПриема <> &Пусто");
	
	Запрос.УстановитьПараметр("Подразделение", Объект.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ВсеПодразделения", Объект.ПодразделениеКомпании.Пустая());
	Запрос.УстановитьПараметр("Период", НачПериода);
	Запрос.УстановитьПараметр("ДатаПриема", КонПериода);
	Запрос.УстановитьПараметр("Пусто", Дата("01.01.01 00:00:00"));
	
	Выб=Запрос.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		Нов= Объект.Сотрудники.Добавить();
		Нов.Сотрудник=Выб.Ссылка;
	КонецЦикла;
	
	ЗаполнитьПоKPIНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоKPIНаСервере()

 Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидОперацииВводаФакта.ВводСмартЗадач") Тогда
			
		Объект.ПерсональныеПоказатели.Очистить();
		
		Если Объект.Периодичность=Перечисления.Периодичность.Месяц Тогда
			НачПериода=НачалоМесяца(Объект.ПериодПланирования);
			КонПериода=КонецМесяца(Объект.ПериодПланирования);
		ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Квартал Тогда
			НачПериода=НачалоКвартала(Объект.ПериодПланирования);
			КонПериода=КонецКвартала(Объект.ПериодПланирования);
		ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Год Тогда
			НачПериода=НачалоГода(Объект.ПериодПланирования);
			КонПериода=КонецГода(Объект.ПериодПланирования);
		Иначе
			Сообщить("Неверная периодичность");
			Возврат;
		КонецЕсли;
		
		Для Каждого ТекСтр из Объект.Сотрудники Цикл
			
			Запрос=Новый Запрос("ВЫБРАТЬ
			|	СоставKPI.Должность,
			|	СоставKPI.Категория,
			|	СоставKPI.KPI,
			|	СоставKPI.Вес,
			|	СоставKPI.Период
			|ИЗ
			|	РегистрСведений.СоставKPI.СрезПоследних(&Дата, ) КАК СоставKPI
			|ГДЕ
			|	СоставKPI.Должность = &Должность
			|	И СоставKPI.Категория = &Категория
			|	И СоставKPI.Периодичность = &Периодичность
			|	И СоставKPI.ПодразделениеКомпании = &ПодразделениеКомпании
			|
			|УПОРЯДОЧИТЬ ПО
			|	СоставKPI.Период УБЫВ");
			
			Запрос.УстановитьПараметр("Должность", ТекСтр.Сотрудник);
			Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
			Запрос.УстановитьПараметр("Дата", КонПериода);
			Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
			Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
			
			ТЗ = Запрос.Выполнить().Выгрузить();
			
			Если ТЗ.Количество()=0 Тогда
				
				Запрос.УстановитьПараметр("Должность", ТекСтр.Сотрудник.Должность);
				Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
				Запрос.УстановитьПараметр("Дата", КонПериода);
				Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
				Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
				
			КонецЕсли;
			
			Выб=Запрос.Выполнить().Выбрать();
			ПослДата=Дата("01.01.01 00:00:00");
			
			Если Выб.Следующий() Тогда
				ПослДата=Выб.Период;
			КонецЕсли;
			
			Запрос=Новый Запрос("ВЫБРАТЬ
			|	СоставKPI.Должность,
			|	СоставKPI.Категория,
			|	СоставKPI.KPI,
			|	СоставKPI.Вес
			|ИЗ
			|	РегистрСведений.СоставKPI.СрезПоследних(&Дата, ) КАК СоставKPI
			|ГДЕ
			|	СоставKPI.Должность = &Должность
			|	И СоставKPI.Категория = &Категория
			|	И СоставKPI.Периодичность = &Периодичность
			|	И СоставKPI.KPI.СпособРасчета = &СпособРасчета
			|	И СоставKPI.Период = &Период
			|	И СоставKPI.ПодразделениеКомпании = &ПодразделениеКомпании
			|
			|УПОРЯДОЧИТЬ ПО
			|	СоставKPI.Период УБЫВ");
			
			Запрос.УстановитьПараметр("Должность", ТекСтр.Сотрудник); 
			Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
			Запрос.УстановитьПараметр("Дата", КонПериода);
			Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
			Запрос.УстановитьПараметр("СпособРасчета", Перечисления.ВидРасчетаKPI.РучнойВвод);
			Запрос.УстановитьПараметр("Период", ПослДата);
			Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
			
			ТЗ=Запрос.Выполнить().Выгрузить();
			
			Если ТЗ.Количество()=0 Тогда
				
				Запрос.УстановитьПараметр("Должность", ТекСтр.Сотрудник.Должность);
				Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
				Запрос.УстановитьПараметр("Дата", КонПериода);
				Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
				Запрос.УстановитьПараметр("СпособРасчета", Перечисления.ВидРасчетаKPI.РучнойВвод);
				Запрос.УстановитьПараметр("Период", ПослДата);
				Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
				
			КонецЕсли;
			
			Выб=Запрос.Выполнить().Выбрать();
			
			Пока Выб.Следующий() Цикл
				Нов = Объект.ПерсональныеПоказатели.Добавить();
				Нов.Показатель = Выб.KPI;
				Нов.Код = Выб.KPI.Код;
				Нов.Сотрудник=ТекСтр.Сотрудник;
			КонецЦикла;
			
			//бч
			Запрос=Новый Запрос("ВЫБРАТЬ
			|	ЦелевыеПоказатели.Должность,
			|	ЦелевыеПоказатели.Категория,
			|	ЦелевыеПоказатели.Период,
			|	ЦелевыеПоказатели.БазоваяЧасть
			|ИЗ
			|	РегистрСведений.ЦелевыеПоказатели.СрезПоследних(&Дата, ) КАК ЦелевыеПоказатели
			|ГДЕ
			|	ЦелевыеПоказатели.Должность = &Должность
			|	И ЦелевыеПоказатели.Категория = &Категория
			|	И ЦелевыеПоказатели.Периодичность = &Периодичность
			|	И ЦелевыеПоказатели.ПодразделениеКомпании = &ПодразделениеКомпании
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЦелевыеПоказатели.Период УБЫВ");
			
			Запрос.УстановитьПараметр("Должность", ТекСтр.Сотрудник);
			Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
			Запрос.УстановитьПараметр("Дата", КонПериода);
			Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
			Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
			
			ТЗ=Запрос.Выполнить().Выгрузить();
			
			Если ТЗ.Количество()=0 Тогда
				
				Запрос.УстановитьПараметр("Должность", ТекСтр.Сотрудник.Должность);
				Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
				Запрос.УстановитьПараметр("Дата", КонПериода);
				Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
				Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
				
			КонецЕсли;
			
			Выб=Запрос.Выполнить().Выбрать();
			
			ПослДата=Дата("01.01.01 00:00:00");
			Если Выб.Следующий() Тогда
				ПослДата=Выб.Период;
			КонецЕсли;
			
			Запрос=Новый Запрос("ВЫБРАТЬ
			|	ЦелевыеПоказатели.Должность,
			|	ЦелевыеПоказатели.Категория,
			|	ЦелевыеПоказатели.Период,
			|	ЦелевыеПоказатели.БазоваяЧасть
			|ИЗ
			|	РегистрСведений.ЦелевыеПоказатели.СрезПоследних(&Дата, ) КАК ЦелевыеПоказатели
			|ГДЕ
			|	ЦелевыеПоказатели.Должность = &Должность
			|	И ЦелевыеПоказатели.Категория = &Категория
			|	И ЦелевыеПоказатели.Периодичность = &Периодичность
			|	И ЦелевыеПоказатели.ПодразделениеКомпании = &ПодразделениеКомпании
			|	И ЦелевыеПоказатели.БазоваяЧасть.СпособРасчета = &СпособРасчета
			|	И ЦелевыеПоказатели.Период = &Период
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЦелевыеПоказатели.Период УБЫВ");

			Запрос.УстановитьПараметр("Должность", ТекСтр.Сотрудник);
			Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
			Запрос.УстановитьПараметр("Дата", КонПериода);
			Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
			Запрос.УстановитьПараметр("СпособРасчета", Перечисления.ВидРасчетаKPI.РучнойВвод);
			Запрос.УстановитьПараметр("Период", ПослДата);
			Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
			
			ТЗ=Запрос.Выполнить().Выгрузить();
			
			Если ТЗ.Количество()=0 Тогда
				
				Запрос.УстановитьПараметр("Должность", ТекСтр.Сотрудник.Должность);
				Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
				Запрос.УстановитьПараметр("Дата", КонПериода);
				Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
				Запрос.УстановитьПараметр("СпособРасчета", Перечисления.ВидРасчетаKPI.РучнойВвод);
				Запрос.УстановитьПараметр("Период", ПослДата);
				Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
				
			КонецЕсли;
			
			Выб=Запрос.Выполнить().Выбрать();
			
			Пока Выб.Следующий() Цикл
				Нов = Объект.ПерсональныеПоказатели.Добавить();
				Нов.Показатель=Выб.БазоваяЧасть;
				Нов.Сотрудник=ТекСтр.Сотрудник;
				Нов.Код = Выб.БазоваяЧасть.Код;
			КонецЦикла;

		КонецЦикла;
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидОперацииВводаФакта.ВводЦелевыхПоказателей") Тогда
		
		Объект.ПерсональныеПоказатели.Очистить();
		Объект.ОбщиеПоказатели.Очистить();
		
		Если Объект.Периодичность=Перечисления.Периодичность.Месяц Тогда
			НачПериода=НачалоМесяца(Объект.ПериодПланирования);
			КонПериода=КонецМесяца(Объект.ПериодПланирования);
		ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Квартал Тогда
			НачПериода=НачалоКвартала(Объект.ПериодПланирования);
			КонПериода=КонецКвартала(Объект.ПериодПланирования);
		ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Год Тогда
			НачПериода=НачалоГода(Объект.ПериодПланирования);
			КонПериода=КонецГода(Объект.ПериодПланирования);
		Иначе
			Сообщить("Неверная периодичность");
			Возврат;
		КонецЕсли;
		
		Для Каждого ТекСтр Из Объект.Сотрудники Цикл 
			
			Запрос=Новый Запрос("ВЫБРАТЬ
			|	СоставKPI.Должность,
			|	СоставKPI.Категория,
			|	СоставKPI.KPI,
			|	СоставKPI.Вес,
			|	СоставKPI.Период
			|ИЗ
			|	РегистрСведений.СоставKPI.СрезПоследних(&Дата, ) КАК СоставKPI
			|ГДЕ
			|	СоставKPI.Должность = &Должность
			|	И СоставKPI.Категория = &Категория
			|	И СоставKPI.Периодичность = &Периодичность
			|	И СоставKPI.ПодразделениеКомпании = &ПодразделениеКомпании
			|
			|УПОРЯДОЧИТЬ ПО
			|	СоставKPI.Период УБЫВ");
			
			Запрос.УстановитьПараметр("Должность", ТекСтр.Сотрудник); 
			Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
			Запрос.УстановитьПараметр("Дата", КонПериода);
			Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
			Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
			
			ТЗ=Запрос.Выполнить().Выгрузить();
			
			Если ТЗ.Количество()=0 Тогда
				
				Запрос.УстановитьПараметр("Должность", ТекСтр.Сотрудник.Должность);
				Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
				Запрос.УстановитьПараметр("Дата", КонПериода);
				Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
				Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
				
			КонецЕсли;
			
			Выб=Запрос.Выполнить().Выбрать();
			
			ПослДата=Дата("01.01.01 00:00:00");
			
			Если Выб.Следующий() Тогда
				ПослДата=Выб.Период;
			КонецЕсли;
			
			Запрос=Новый Запрос("ВЫБРАТЬ
			|	СоставKPI.Должность,
			|	СоставKPI.Категория,
			|	СоставKPI.KPI,
			|	СоставKPI.Вес
			|ИЗ
			|	РегистрСведений.СоставKPI.СрезПоследних(&Дата, ) КАК СоставKPI
			|ГДЕ
			|	СоставKPI.Должность = &Должность
			|	И СоставKPI.Категория = &Категория
			|	И СоставKPI.Периодичность = &Периодичность
			|	И СоставKPI.KPI.СпособРасчета = &СпособРасчета
			|	И СоставKPI.Период = &Период
			|	И СоставKPI.ПодразделениеКомпании = &ПодразделениеКомпании
			|
			|УПОРЯДОЧИТЬ ПО
			|	СоставKPI.Период УБЫВ");
			
			Запрос.УстановитьПараметр("Должность",ТекСтр.Сотрудник); 
			Запрос.УстановитьПараметр("Категория",ТекСтр.Сотрудник.КатегорияДолжности);
			Запрос.УстановитьПараметр("Дата",КонПериода);
			Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
			Запрос.УстановитьПараметр("СпособРасчета", Перечисления.ВидРасчетаKPI.Автоматический);
			Запрос.УстановитьПараметр("Период", ПослДата);
			Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
			
			ТЗ=Запрос.Выполнить().Выгрузить();
			
			Если ТЗ.Количество()=0 Тогда
				
				Запрос.УстановитьПараметр("Должность", ТекСтр.Сотрудник.Должность);
				Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
				Запрос.УстановитьПараметр("Дата", КонПериода);
				Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
				Запрос.УстановитьПараметр("СпособРасчета", Перечисления.ВидРасчетаKPI.Автоматический);
				Запрос.УстановитьПараметр("Период", ПослДата);
				Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
				
			КонецЕсли;
			
			Выб=Запрос.Выполнить().Выбрать();
			
			Пока Выб.Следующий() Цикл
				
				СпПар=ПолучитьСписокПараметров(Выб.KPI.Формула);
				
				Для Каждого ТекЭл из СпПар Цикл
					
					Если ТекЭл.Значение.ВидПоказателя=Перечисления.ВидРасчетаKPI.РучнойВвод Тогда
						
						Если ТекЭл.Значение.Общий Тогда
							
							Если Объект.ОбщиеПоказатели.Найти(ТекЭл.Значение,"Показатель")=Неопределено Тогда
								Нов=Объект.ОбщиеПоказатели.Добавить();
								Нов.Показатель=ТекЭл.Значение;
								Нов.Код = ТекЭл.Значение.Код;
							КонецЕсли;
							
						Иначе
							
							МС=Объект.ПерсональныеПоказатели.НайтиСтроки(Новый Структура("Сотрудник, Показатель", ТекСтр.Сотрудник, ТекЭл.Значение));
							Если МС.Количество()=0 Тогда
								Нов=Объект.ПерсональныеПоказатели.Добавить();
								Нов.Показатель=ТекЭл.Значение;
								Нов.Сотрудник=ТекСтр.Сотрудник;
								Нов.Код = ТекЭл.Значение.Код;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
			//бч
			Запрос=Новый Запрос("ВЫБРАТЬ
			|	ЦелевыеПоказатели.Должность,
			|	ЦелевыеПоказатели.Категория,
			|	ЦелевыеПоказатели.Период,
			|	ЦелевыеПоказатели.БазоваяЧасть
			|ИЗ
			|	РегистрСведений.ЦелевыеПоказатели.СрезПоследних(&Дата, ) КАК ЦелевыеПоказатели
			|ГДЕ
			|	ЦелевыеПоказатели.Должность = &Должность
			|	И ЦелевыеПоказатели.Категория = &Категория
			|	И ЦелевыеПоказатели.Периодичность = &Периодичность
			|	И ЦелевыеПоказатели.ПодразделениеКомпании = &ПодразделениеКомпании
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЦелевыеПоказатели.Период УБЫВ");
			
			Запрос.УстановитьПараметр("Должность", ТекСтр.Сотрудник);
			Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
			Запрос.УстановитьПараметр("Дата", КонПериода);
			Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
			Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
			
			ТЗ=Запрос.Выполнить().Выгрузить();
			
			Если ТЗ.Количество()=0 Тогда
				
				Запрос.УстановитьПараметр("Должность", ТекСтр.Сотрудник.Должность);
				Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
				Запрос.УстановитьПараметр("Дата", КонПериода);
				Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
				Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
				
			КонецЕсли;
			
			Выб=Запрос.Выполнить().Выбрать();
			
			ПослДата=Дата("01.01.01 00:00:00");
			
			Если Выб.Следующий() Тогда
				ПослДата=Выб.Период;
			КонецЕсли;
			
			Запрос=Новый Запрос("ВЫБРАТЬ
			|	ЦелевыеПоказатели.Должность,
			|	ЦелевыеПоказатели.Категория,
			|	ЦелевыеПоказатели.Период,
			|	ЦелевыеПоказатели.БазоваяЧасть
			|ИЗ
			|	РегистрСведений.ЦелевыеПоказатели.СрезПоследних(&Дата, ) КАК ЦелевыеПоказатели
			|ГДЕ
			|	ЦелевыеПоказатели.Должность = &Должность
			|	И ЦелевыеПоказатели.Категория = &Категория
			|	И ЦелевыеПоказатели.Периодичность = &Периодичность
			|	И ЦелевыеПоказатели.ПодразделениеКомпании = &ПодразделениеКомпании
			|	И ЦелевыеПоказатели.БазоваяЧасть.СпособРасчета <> &СпособРасчета
			|	И ЦелевыеПоказатели.Период = &Период
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЦелевыеПоказатели.Период УБЫВ");

			Запрос.УстановитьПараметр("Должность", ТекСтр.Сотрудник);
			Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
			Запрос.УстановитьПараметр("Дата", КонПериода);
			Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
			Запрос.УстановитьПараметр("СпособРасчета", Перечисления.ВидРасчетаKPI.РучнойВвод);
			Запрос.УстановитьПараметр("Период", ПослДата);
			Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
			
			ТЗ=Запрос.Выполнить().Выгрузить();
			
			Если ТЗ.Количество()=0 Тогда
				
				Запрос.УстановитьПараметр("Должность", ТекСтр.Сотрудник.Должность);
				Запрос.УстановитьПараметр("Категория", ТекСтр.Сотрудник.КатегорияДолжности);
				Запрос.УстановитьПараметр("Дата", КонПериода);
				Запрос.УстановитьПараметр("Периодичность", Объект.Периодичность);
				Запрос.УстановитьПараметр("СпособРасчета", Перечисления.ВидРасчетаKPI.РучнойВвод);
				Запрос.УстановитьПараметр("Период", ПослДата);
				Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
				
			КонецЕсли;
			
			Выб=Запрос.Выполнить().Выбрать();
			
			Пока Выб.Следующий() Цикл
				
				Если ТипЗнч(Выб.БазоваяЧасть)=ТипЗнч(Справочники.KPI.ПустаяСсылка()) Тогда
					
					СпПар=ПолучитьСписокПараметров(Выб.БазоваяЧасть.Формула);
					
					Для Каждого ТекЭл из СпПар Цикл
						
						Если ТекЭл.Значение.ВидПоказателя=Перечисления.ВидРасчетаKPI.РучнойВвод Тогда
							
							Если ТекЭл.Значение.Общий Тогда
								
								Если Объект.ОбщиеПоказатели.Найти(ТекЭл.Значение,"Показатель")=Неопределено Тогда
									Нов=Объект.ОбщиеПоказатели.Добавить();
									Нов.Показатель=ТекЭл.Значение;
									Нов.Код = ТекЭл.Значение.Код;
								КонецЕсли;
								
							Иначе

								МС=Объект.ПерсональныеПоказатели.НайтиСтроки(Новый Структура("Сотрудник,Показатель", ТекСтр.Сотрудник, ТекЭл.Значение));
								Если МС.Количество()=0 Тогда
									Нов=Объект.ПерсональныеПоказатели.Добавить();
									Нов.Показатель=ТекЭл.Значение;
									Нов.Сотрудник=ТекСтр.Сотрудник;
									Нов.Код = ТекЭл.Значение.Код;
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСотрудникиОбновить(Команда)
	
	ПроверитьСотрудников();
	
	ЗаполнениеСотрудников();
	
	ПроверитьОтображениеКолонкиКатегория(); 
	
КонецПроцедуры

Процедура ПроверитьСотрудников()
			
	Если Объект.Периодичность=Перечисления.Периодичность.Месяц Тогда
		НачПериода=НачалоМесяца(Объект.ПериодПланирования);
		КонПериода=КонецМесяца(Объект.ПериодПланирования);
	ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Квартал Тогда
		НачПериода=НачалоКвартала(Объект.ПериодПланирования);
		КонПериода=КонецКвартала(Объект.ПериодПланирования);
	ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Год Тогда
		НачПериода=НачалоГода(Объект.ПериодПланирования);
		КонПериода=КонецГода(Объект.ПериодПланирования);
	Иначе
		Сообщить("Неверная периодичность");
		Возврат;
	КонецЕсли;
		
		Запрос=Новый Запрос("ВЫБРАТЬ
		|	Сотрудники.Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	НЕ Сотрудники.ПометкаУдаления
		|	И НЕ Сотрудники.ЭтоГруппа
		|	И Сотрудники.Подразделение = &Подразделение
		|	И (НЕ Сотрудники.ДатаУвольнения < &Период
		|			ИЛИ Сотрудники.ДатаУвольнения = &Пусто)
		|	И Сотрудники.ДатаПриема < &ДатаПриема
		|	И Сотрудники.ДатаПриема <> &Пусто");
		
		Запрос.УстановитьПараметр("Подразделение", Объект.ПодразделениеКомпании);
		Запрос.УстановитьПараметр("Период", НачПериода);
		Запрос.УстановитьПараметр("ДатаПриема", КонПериода);
		Запрос.УстановитьПараметр("Пусто",Дата("01.01.01 00:00:00"));
		
		ТЗ=Запрос.Выполнить().Выгрузить();
		
		Для Каждого ТекСтр из ТЗ Цикл
			
		НС = Объект.Сотрудники.НайтиСтроки(Новый Структура("Сотрудник", ТекСтр.Ссылка));
		
		Если НС=Неопределено Тогда
			Нов=Объект.Сотрудники.Добавить();
			Нов.Сотрудник=ТекСтр.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Найден = Истина;
	
	Пока Найден Цикл
		
		Найден = Ложь;
		
		КопСот = Объект.Сотрудники.Выгрузить();
		
		Для Каждого ТекСтр из КопСот Цикл
			
			НС=ТЗ.Найти(ТекСтр.Сотрудник,"Ссылка");
			
			Если НС = Неопределено Тогда
				
				Найден = Истина;
				
				НС2 = Объект.Сотрудники.НайтиСтроки(Новый Структура("Сотрудник",ТекСтр.Сотрудник));
				Если НС2<>Неопределено Тогда
					
					Объект.Сотрудники.Удалить(НС2[0]);
					
					МС = Объект.ПерсональныеПоказатели.НайтиСтроки(Новый Структура("Сотрудник", ТекСтр.Сотрудник));
					
					Для Каждого Эл из МС Цикл
						Объект.ПерсональныеПоказатели.Удалить(Эл);
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Объект.Сотрудники.Сортировать("Сотрудник");
	
КонецПроцедуры

Процедура ЗаполнениеСотрудников()
	
	Если Объект.Периодичность=Перечисления.Периодичность.Месяц Тогда
		НачПериода=НачалоМесяца(Объект.ПериодПланирования);
		КонПериода=КонецМесяца(Объект.ПериодПланирования);
	ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Квартал Тогда
		НачПериода=НачалоКвартала(Объект.ПериодПланирования);
		КонПериода=КонецКвартала(Объект.ПериодПланирования);
	ИначеЕсли Объект.Периодичность=Перечисления.Периодичность.Год Тогда
		НачПериода=НачалоГода(Объект.ПериодПланирования);
		КонПериода=КонецГода(Объект.ПериодПланирования);
	Иначе
		Сообщить("Неверная периодичность");
		Возврат;
	КонецЕсли;

		ТабСот = Объект.Сотрудники.Выгрузить();
		ТабФакт = Объект.ПерсональныеПоказатели.Выгрузить();
		ОбФакт = Объект.ОбщиеПоказатели.Выгрузить();
		
		ЗаполнитьПоKPI();
		
		Для Каждого ТекСтр из ТабФакт Цикл
			МС=Объект.ПерсональныеПоказатели.НайтиСтроки(Новый Структура("Сотрудник,Должность,Показатель",ТекСтр.Сотрудник, ТекСтр.должность, ТекСтр.Показатель));
			Если МС.Количество()=0 Тогда
			Иначе
				Нов=МС[0];
				Нов.Сотрудник=ТекСтр.Сотрудник;
				Нов.Должность=ТекСтр.Должность;
				Нов.Показатель=ТекСтр.Показатель;
				Нов.Факт=ТекСтр.Факт;
			КонецЕсли;
		КонецЦикла;
		
	    Для Каждого ТекСтр из ОбФакт Цикл
			МС=Объект.ПерсональныеПоказатели.НайтиСтроки(Новый Структура("Показатель",ТекСтр.Показатель));
			Если МС.Количество()=0 Тогда
			Иначе
				Нов=МС[0];
				Нов.Показатель=ТекСтр.Показатель;
				Нов.Факт=ТекСтр.Факт;
			КонецЕсли;
		КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьKPI(Команда)
	
	 ЗаполнитьПоKPIНаСервере();
	 
КонецПроцедуры
